Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཟད་པར་གྱི་སྐྱེ་མཆེད་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ།། །།
en: Even the names of the sense fields of total consummation do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ། བམ་པོ་གསུམ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་བཅྭ་བརྒྱད་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘eighteen aspects of emptiness’ are merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད་འགག་པ་མེད་དེ་མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་ལ།
en: Anything that is conceptualized neither arises nor ceases, and is only conventionally designated by names and symbols.

source: སྟོང་པ་ཉིད་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the aspects of emptiness do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘ten powers of the tathāgatas’ are merely conceptualized.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the ten powers of the tathāgatas do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། མི་འཇིགས་པ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four assurances’ are merely conceptualized.

source: མི་འཇིགས་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the assurances do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘four kinds of exact knowledge’ are merely conceptualized.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of these kinds of exact knowledge do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། བྱམས་པ་ཆེན་པོ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, ‘great loving kindness’ is merely conceptualized.

source: བྱམས་པ་ཆེན་པོའི་མིང་དེ་ཡང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the name of great loving kindness does not exist internally, nor does it exist externally, and nor does it abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། སྙིང་རྗེ་ཆེན་པོ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, ‘great compassion’ is merely conceptualized.

source: སྙིང་རྗེ་ཆེན་པོའི་མིང་དེ་ཡང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the name of great compassion does not exist internally, nor does it exist externally, and nor does it abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘eighteen distinct qualities of the buddhas’ are merely conceptualized.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཅེས་བྱ་བའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the eighteen distinct qualities of the buddhas do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘understanding of all phenomena, the understanding of the aspects of the path, and the understanding of omniscience’ are merely conceptualized.

source: ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the understanding of all phenomena, the understanding of the aspects of the path, and the understanding of omniscience do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ།
en: “Śāradvatī­putra, the ‘six transcendent perfections’ are merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད་འགག་པ་མེད་དེ།མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་ལ།
en: Anything that is conceptualized neither arises nor ceases, and is only conventionally designated by names and symbols.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the six transcendent perfections do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། མངོན་པར་ཤེས་པ་དྲུག་ཅེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘six extrasensory powers’ are merely conceptualized.

source: མངོན་པར་ཤེས་པའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། མིག་ལྔ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ།
en: Even the names of the extrasensory powers do not exist internally, nor do they exist externally, and nor do they abide between these two “Śāradvatī­putra, the ‘five eyes’ are merely conceptualized.

source: ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །ཆོས་སུ་བཏགས་པ་དེ་ལ་ནི་སྐྱེ་བ་མེད་འགག་པ་མེད་དེ། མིང་གི་བརྡས་ཐ་སྙད་དུ་འདོགས་པ་ཁོ་ནར་ཟད་ལ།
en: Anything that is conceptualized neither arises nor ceases, and is only conventionally designated by names and symbols.

source: མིག་གི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the five eyes do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘thirty-two major marks of a superior man’ are merely conceptualized.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the thirty-two major marks of a superior man do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཞེས་བྱ་བ་གང་དག་ཡིན་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། ཆོས་སུ་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: “Śāradvatī­putra, the ‘eighty excellent minor marks’ are merely conceptualized.

source: དཔེ་བྱད་བཟང་པོའི་མིང་དེ་དག་ཀྱང་ནང་ན་ཡང་མེད་ཕྱི་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མི་གནས་སོ། །
en: Even the names of the eighty excellent minor marks do not exist internally, nor do they exist externally, and nor do they abide between these two.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་མིང་གི་བརྡར་བཏགས་པ་དང་། ཆོས་སུ་བཏགས་པ་ལ་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: “Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom should train accordingly in those things which are conceptualized as names and symbols.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མིང་གི་བརྡར་བཏགས་པའི་ཆོས་དེ་ལྟར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Great bodhisattva beings should understand in that manner those phenomena which are conceptualized as names and symbols.

source: དེས་མིང་གི་བརྡར་བཏགས་པའི་ཆོས་ཁོང་དུ་ཆུད་པས གཟུགས་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཚོར་བ་དང་།
en: By understanding those phenomena which are conceptualized as names and symbols, they will not become fixated on physical forms.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: They will not become fixated on feelings, perceptions, formative predispositions, and consciousness, and similarly, they will not become fixated on [any other phenomena], up to and including [the dependent link] of aging and death.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: Likewise, they will not become fixated on the four applications of mindfulness, and similarly, they will not become fixated on [any of the other causal attributes] up to and including the noble eightfold path.

source: དེ་བཞིན་དུ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: Likewise, they will not become fixated on the three gateways to liberation, and similarly, they will not become fixated on [any other attainments], up to and including the emptiness of the essential nature of non-entities.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: Likewise, they will not become fixated on the ten powers of the tathāgatas, and similarly, they will not become fixated on [any of the other fruitional attributes], up to and including omniscience.

source: དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་བཏགས་པ་ཙམ་དང་། མིང་ཙམ་དུ་བས་པ་ལགས་ན། འོ་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་སམ།
en: Likewise, they will not become fixated on the six transcendent perfections, and similarly, they will not become fixated on [any of the other fruitional attributes], up to and including the eighty minor marks.”

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ཀྱང་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་སམ། བྱང་ཆུབ་ཀྱི་བར་ཡང་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་སམ། དེ་ལྟ་ལགས་ན་ནི་ཚངས་པར་སྤྱོད་པ་ཡང་དངོས་པོ་མ་མཆིས་པར་འགྱུར་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡང་དངོས་པོ་མ་མཆིས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཀྱང་དངོས་པོ་མ་མཆིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆོས་མངོན་པར་རྟོགས་པ་ཡང་མ་མཆིས་པར་འགྱུར་ལ།
en: Thereupon, the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord, if all phenomena are merely conceptualized and merely nominal, would it not follow, Reverend Lord, that all things have an essential nature of non-entity, or that even the attributes of the bodhisattvas would have an essential nature of non-entity, or that all things as far as enlightenment would have an essential nature of non-entity, or, if that were the case, that the practice of chastity would also become a non-entity, the path of the bodhisattvas would become a non-entity, even the six transcendent perfections would become non-entities, and the clear realizations of the doctrine that great bodhisattva beings have would also be non-existent?

source: སྡུག་བསྔལ་ལས་རྣམ་པར་གྲོལ་བ་ཡང་མ་མཆིས་པར་བདག་སྨྲ་ལགས་སོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Indeed, I say that liberation from suffering would also be non-existent.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: Thereupon, the Blessed One replied to the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, do you think that one is liberated by perceiving physical forms as entities?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །
en: “No Lord!” he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving feelings, perceptions, formative predispositions, and consciousness as entities?”

source: གསོལ་པ།
en: “No Lord!”

source: བཅོམ་ལྡན་འདས་མ་ལགས་གོ། །
en: he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the eyes as an entity?”

source: བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །
en: “No Lord!”

source: རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the ears, the nose, the tongue, the body, and the mental faculty as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving sights as entities?”

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving sounds, odors, tastes, tangibles, and mental phenomena as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the ears, the sensory element of sounds, and the sensory element of auditory consciousness as entities?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །
en: “No Lord!” he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by by perceiving the sensory element of the nose, the sensory element of odors, and the sensory element of olfactory consciousness as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the tongue, the sensory element of tastes, and the sensory element of gustatory consciousness as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the body, the sensory element of tangibles, and the sensory element of tactile consciousness as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the mental faculty, the sensory element of mental phenomena, and the sensory element of mental consciousness as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འཕགས་པའི་བདེན་པ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་དུ་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the noble truths, and in the same vein, [all the aforementioned phenomena] up to and including the [dependent link of] aging and death as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the applications of mindfulness, and in the same vein, [all the aforementioned causal attributes] as far as the noble eightfold path as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། སྟོང་པ་ཉིད་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the gateways to liberation, and in the same vein, [all the aforementioned attainments], up to and including the eighteen aspects of emptiness as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “[Śāradvatī­putra,] do you think that one is liberated by perceiving the ten powers of the tathāgatas, and in the same vein, [all the aforementioned fruitional attributes], up to and including omniscience as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དུ་དངོས་པོར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the six transcendent perfections, and in the same vein, [all the aforementioned fruitional attributes], up to and including the eighty minor marks as entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving physical forms as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving feelings, perceptions, formative predispositions, and consciousness as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that is liberated by perceiving the eyes as a non-entity?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the ears, the nose, the tongue, the body, and the mental faculty as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving sights as non-entities?”

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving sounds, odors, tastes, tangibles, and mental phenomena as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the ears, the sensory element of sounds, and the sensory element of auditory consciousness as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the nose, the sensory element of odors, and the sensory element of olfactory consciousness as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the tongue, the sensory element of tastes, and the sensory element of gustatory consciousness as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the body, the sensory element of tangibles, and the sensory element of tactile consciousness as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the mental faculty, the sensory element of mental phenomena, and the sensory element of mental consciousness as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འཕགས་པའི་བདེན་པ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་དུ་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the noble truths, and in the same vein, [all the other aforementioned phenomena], up to and including the [dependent link of] aging and death, as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the applications of mindfulness, and in the same vein, [all the other aforementioned causal attributes], up to and including the noble eightfold path, as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the gateways to liberation, and in the same vein, [all the other aforementioned attainments], up to and including the emptiness of the essential nature of non-entities, as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the ten powers of the tathāgatas, and in the same vein, [all the other aforementioned fruitional attributes], up to and including omniscience, as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དུ་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the six transcendent perfections, and in the same vein, [all the other aforementioned fruitional attributes], up to and including the eighty minor marks, as non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་དངོས་པོ་དང་། དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving physical forms as entities and non-entities?”

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Do you think that one is liberated by perceiving feelings, perceptions, formative predispositions, and consciousness as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: he replied. “Śāradvatī­putra, do you think that one is liberated by perceiving the eyes as an entity and a non-entity?”

source: རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the ears, the nose, the tongue, the body, and the mental faculty as entities and non-entities?”
